Revit 2027 API
ReferencePoint.GetPointElementReference Method
Retrieve a copy of the rule that computes the location of the ReferencePoint relative to other elements in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointElementReference GetPointElementReference()
Public Function GetPointElementReference As PointElementReference
public:
PointElementReference^ GetPointElementReference()
member GetPointElementReference : unit -> PointElementReference
Return Value
PointElementReference
A PointElementReference object, or null if the ReferencePoint does not have a reference.
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace